package headfirst.PhraseOMatic;

public class PhraseOMatic {
    public static void main(String[] args) {

        String[] wordListOne = {"круглосуточный", "трех-звенный", "30000-футовый", "взаимный",
                "богоподобный", "неистовый", "взаимный", "обоюдный выигрыш", "фронтэнд", "на основе веб-технологий",
                "лямбда-зонд", "проникающий", "умный", "шесть", "Автово", "метод критического пути", "динамичный"};

        String[] wordListTwo = {"уполномоченный", "трудный", "чистый продукт", "ориентированный", "фуммигатор",
                "центральный", "распределенный", "паук", "фирменный", "нестандартный ум", "позиционированный",
                "сетевой", "сфокусированный", "использованный с выгодой", "выровненный", "нацеленный на", "общий",
                "совместный", "ускоренный", "здравый", "оголённый", "сигарета", "навзничь", "испокон веков"};

        String[] wordListThree = {"мизерный", "процесс", "пункт разгрузки", "выход из положения", "тип структуры",
                "талант", "жидкокристаллический", "подход", "уровень завоевания внимания", "портал", "период времени",
                "обзор", "образец", "пункт следования", "парсить", "яхт-клуб", "кожура"};

        int oneLength = wordListOne.length;
        int twoLength = wordListTwo.length;
        int threeLength = wordListThree.length;

        int rand1 = (int) (Math.random() * oneLength);
        int rand2 = (int) (Math.random() * twoLength);
        int rand3 = (int) (Math.random() * threeLength);

        String phrase = wordListOne[rand1] + " " + wordListTwo[rand2] + " " + wordListThree[rand3];

        System.out.println("Все, что нам нужно, - это " + phrase);
    }
}
